# Установка базового образа Node.js версии 22 на базе Alpine Linux для минимального размера и безопасности.
FROM node:22-alpine
# Установка рабочей директории внутри контейнера, где будут находиться файлы приложения.
WORKDIR /app
# Копирование файлов package.json и package-lock.json (если есть) в рабочую директорию.
COPY package*.json ./
# Установка зависимостей приложения, указанных в package.json.
RUN npm install
# Копирование остальных файлов приложения в рабочую директорию.
COPY . .
# Открытие порта 5173 для доступа к приложению извне контейнера.
EXPOSE 5173
# Определение команды, которая будет выполняться при запуске контейнера. В данном случае, это запуск приложения в режиме разработки с указанием хоста.
CMD ["npm", "run", "dev", "--", "--host"]